In [43]:
import pandas
pandas.__version__

'1.0.3'

In [44]:
import numpy as np
import pandas as pd

In [45]:
a = pd.Series([1, 2, 3, 4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [47]:
a.values

array([1, 2, 3, 4])

In [48]:
a.index

RangeIndex(start=0, stop=4, step=1)

In [49]:
marks= pd.Series([30, 52, 70, 43], 
index=['Emma Watson', 'Dharia', 'Camile Cabello','Selena'])

marks

Emma Watson       30
Dharia            52
Camile Cabello    70
Selena            43
dtype: int64

In [50]:
marks['Dharia']

52

In [52]:
marks.name = 'Marks'
marks.index.name = 'Name'
marks

Name
Emma Watson       30
Dharia            52
Camile Cabello    70
Selena            43
Name: Marks, dtype: int64

In [53]:
np.log(marks)

Name
Emma Watson       3.401197
Dharia            3.951244
Camile Cabello    4.248495
Selena            3.761200
Name: Marks, dtype: float64

In [54]:
marks[marks>50]

Name
Dharia            52
Camile Cabello    70
Name: Marks, dtype: int64

In [55]:
marksd = {'Johnny':67, 'Joker':88, 'Charlie':79, 'Maara':99}
print(marksd)
pd.Series(marksd)

{'Johnny': 67, 'Joker': 88, 'Charlie': 79, 'Maara': 99}

Johnny     67
Joker      88
Charlie    79
Maara      99
dtype: int64

In [58]:
a= {"States": ["Kerala", "Karnataka", "Andhra", "Maharashtra", "Delhi"],
        "Year": [2015, 2016, 2017, 2018, 2019],
        "Population": [12000000,12789999,12688888, 13999998, 12888878]}
print(a)
a= pd.DataFrame(a)
a

{'States': ['Kerala', 'Karnataka', 'Andhra', 'Maharashtra', 'Delhi'], 'Year': [2015, 2016, 2017, 2018, 2019], 'Population': [12000000, 12789999, 12688888, 13999998, 12888878]}

        States  Year  Population
0       Kerala  2015    12000000
1    Karnataka  2016    12789999
2       Andhra  2017    12688888
3  Maharashtra  2018    13999998
4        Delhi  2019    12888878

In [59]:
b= pd.DataFrame(a, columns=["Population", "States" ,"Year"])
b

   Population       States  Year
0    12000000       Kerala  2015
1    12789999    Karnataka  2016
2    12688888       Andhra  2017
3    13999998  Maharashtra  2018
4    12888878        Delhi  2019

In [61]:
b['Houses'] = b.Population / b.Year
b

   Population       States  Year       Houses
0    12000000       Kerala  2015  5955.334988
1    12789999    Karnataka  2016  6344.245536
2    12688888       Andhra  2017  6290.970749
3    13999998  Maharashtra  2018  6937.560951
4    12888878        Delhi  2019  6383.792967

In [62]:
b['Series_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
b

   Population       States  Year       Houses  Series_aligned
0    12000000       Kerala  2015  5955.334988               0
1    12789999    Karnataka  2016  6344.245536               1
2    12688888       Andhra  2017  6290.970749               2
3    13999998  Maharashtra  2018  6937.560951               3
4    12888878        Delhi  2019  6383.792967               4

In [63]:
b.to_dict()

{'Population': {0: 12000000,
  1: 12789999,
  2: 12688888,
  3: 13999998,
  4: 12888878},
 'States': {0: 'Kerala',
  1: 'Karnataka',
  2: 'Andhra',
  3: 'Maharashtra',
  4: 'Delhi'},
 'Year': {0: 2015, 1: 2016, 2: 2017, 3: 2018, 4: 2019},
 'Houses': {0: 5955.334987593052,
  1: 6344.245535714285,
  2: 6290.970748636589,
  3: 6937.560951437066,
  4: 6383.792966815255},
 'Series_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [64]:
pd.DataFrame(b.to_dict())

   Population       States  Year       Houses  Series_aligned
0    12000000       Kerala  2015  5955.334988               0
1    12789999    Karnataka  2016  6344.245536               1
2    12688888       Andhra  2017  6290.970749               2
3    13999998  Maharashtra  2018  6937.560951               3
4    12888878        Delhi  2019  6383.792967               4

In [65]:
data = [{'a': i, 'b':i%2==0}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': True}, {'a': 1, 'b': False}, {'a': 2, 'b': True}, {'a': 3, 'b': False}, {'a': 4, 'b': True}, {'a': 5, 'b': False}]

   a      b
0  0   True
1  1  False
2  2   True
3  3  False
4  4   True
5  5  False

In [67]:
pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [68]:
pd.DataFrame(np.random.randint(2, 12),columns=['Hello', 'World'],index=[1, 2,3])

   Hello  World
1     10     10
2     10     10
3     10     10

In [70]:
a= pd.Index([1,2,3,4,5])
a

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [71]:
a[1]

2

In [72]:
a[::-1]

Int64Index([5, 4, 3, 2, 1], dtype='int64')

In [73]:
print(a.size, a.shape, a.ndim, a.dtype)

5 (5,) 1 int64

In [75]:
a = np.random.RandomState(20)
b = pd.Series(a.randint(2, 10, 20))
b

0     5
1     4
2     9
3     9
4     6
5     4
6     3
7     6
8     5
9     8
10    9
11    4
12    2
13    8
14    2
15    7
16    4
17    4
18    5
19    5
dtype: int64

In [76]:
c= pd.DataFrame(a.randint(0, 10, (5, 4)),columns=['A', 'B', 'C', 'D'])
c

   A  B  C  D
0  0  6  6  0
1  9  5  7  5
2  2  6  9  3
3  3  9  0  6
4  2  3  1  8

In [77]:
np.exp(b)

0      148.413159
1       54.598150
2     8103.083928
3     8103.083928
4      403.428793
5       54.598150
6       20.085537
7      403.428793
8      148.413159
9     2980.957987
10    8103.083928
11      54.598150
12       7.389056
13    2980.957987
14       7.389056
15    1096.633158
16      54.598150
17      54.598150
18     148.413159
19     148.413159
dtype: float64

In [79]:
np.sin(c * np.pi / 4)

          A         B         C             D
0  0.000000 -1.000000 -1.000000  0.000000e+00
1  0.707107 -0.707107 -0.707107 -7.071068e-01
2  1.000000 -1.000000  0.707107  7.071068e-01
3  0.707107  0.707107  0.000000 -1.000000e+00
4  1.000000  0.707107  0.707107 -2.449294e-16

In [80]:
rich= pd.Series({'Bill':89999873, 'Jeff': 90373633,
                  'Mukesh': 7837373}, name='RichPeople')
Company= pd.Series({'Bill':'Microsoft', 'Jeff':'Amazon',
                        'Mukesh':'Reliance'}, name='Company')
print(rich)
Company

Bill      89999873
Jeff      90373633
Mukesh     7837373
Name: RichPeople, dtype: int64

Bill      Microsoft
Jeff         Amazon
Mukesh     Reliance
Name: Company, dtype: object

In [81]:
rich.index |Company.index

Index(['Bill', 'Jeff', 'Mukesh'], dtype='object')

In [82]:
a= pd.Series([1,2,3], index=[0, 1, 2])
b= pd.Series([4,5,6], index=[1, 2, 3])
print(a)
print(b)
a
a*b

0    1
1    2
2    3
dtype: int64
1    4
2    5
3    6
dtype: int64

0     NaN
1     8.0
2    15.0
3     NaN
dtype: float64

In [83]:
a.add(b, fill_value=0)

0    1.0
1    6.0
2    8.0
3    6.0
dtype: float64

In [84]:
b

1    4
2    5
3    6
dtype: int64

In [85]:
b

1    4
2    5
3    6
dtype: int64

In [86]:
b1 = pd.DataFrame({"States": ["Kerala", "Karnataka",'Andhra','Maharashtra','Delhi'], "Female_population": ["1656533", "1432633",'2726363','2726265','1424245']})
b1

        States Female_population
0       Kerala           1656533
1    Karnataka           1432633
2       Andhra           2726363
3  Maharashtra           2726265
4        Delhi           1424245

In [88]:
b1.merge(b)

ValueError: Cannot merge a Series without a name

In [89]:
b3 = pd.DataFrame({"state": ["Maharashtra", "Kerala"], "Population": ["100000", "200000"]})
b3
b.merge(b3, right_on='state', left_on='States')

AttributeError: 'Series' object has no attribute 'merge'

In [90]:
i= pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],index=['f', 'e', 'd', 'c', 'b', 'a'])
j= pd.Series(np.arange(len(i), dtype=np.float64),index=['f', 'e', 'd', 'c', 'b', 'a'])

In [91]:
i

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [92]:
j

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [93]:
pd.Series(np.where(pd.isnull(i),j,j), index=i.index)

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [94]:
i.combine_first(i)

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64